---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpacingAppend
source: html/c4dc87f4-8fb4-25fa-bd9c-31198886543d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpacingAppend Property

"Append Position"

## Syntax (C#)
```csharp
public static ForgeTypeId SpacingAppend { get; }
```